
## Plan Result (ithc)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.test-secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.test-secret will be created
  + resource "azurerm_key_vault_secret" "test-secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/toffee-shared-infrastructure-ithc/providers/Microsoft.KeyVault/vaults/toffeesi-ithc"
      + name                    = "test-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":430,"Program":"tfcmt","SHA1":"","Target":"ithc","Vars":{}} -->